attacker145/NRF51822v01/examples/ble_peripheral/ble_app_uart/main_Rev01.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 * Additional files:
   1. nrf_drv_spi.c 
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"


//SPI LIBRARIES
#include "nrf_drv_spi.h"
#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "boards.h"
#include "app_error.h"

//ADC libraries
#include "nrf_drv_adc_Rev01.h"

void adc_config(void);
void adc_read_sample(void);



// SPI SPI SPI SPI
#if defined(BOARD_PCA10036) || defined(BOARD_PCA10040)
#define SPI_CS_PIN   29 /**< SPI CS Pin.*/
#elif defined(BOARD_PCA10028)
//#define SPI_CS_PIN   4  /**< SPI CS Pin.*/
#define SPI_CS_PIN   19  /**< SPI CS Pin.*/			//04/27/2016
#else
#error "Example is not supported on that board."
#endif

#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

#define TEST_STRING "Nordic"
//static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. 6 bytes*/
//static uint8_t       m_rx_buf[sizeof(TEST_STRING)+1];    /**< RX buffer. 7 bytes*/

//static uint8_t       m_tx_buf[7] = TEST_STRING; /**< TX buffer. 7 bytes*/
static uint8_t       m_rx_buf[13] = {0,0,0,0,0,0,0,0,0,0,0,0,0};    						/**< RX buffer. 13 bytes*/

uint8_t	temp_buf[18];
uint8_t	temp_buf1[27];
uint8_t temp_buf2[3];

static const uint8_t adc_conf_tc[]			= {0x40,0x03, 0x01,0x02,0x40,0x71}; 	 //ADC TC config with VBIAS{0x40,0x03,0x01,0x02,0x40,0x70}, w/o VBIAS {0x40,0x03,0x01,0x00,0x40,0x70} 
//static const uint8_t adc_conf_tc[]			= {0x40,0x03, 0x01,0x02,0x30,0x71}; 
//static const uint8_t adc_conf_tc[]			= {0x40,0x03, 0x01,0x02,0x40,0x61};

/*
	0x13 - AN2+ , AN3-
  0x00 - Bias voltage is disabled
	0x30 - Internal reference is always on, Onboard reference selected 
	0x00 - gain of the PGA = 1
*/
static const uint8_t adc_conf_rtd[]		= {0x40,0x03,0x13,0x00,0x40,0x41};      //ADC RTD config {0x40,0x03,0x13,0x00,0x40,0x40}
//static const uint8_t adc_conf_rtd[]		= {0x40,0x03,0x13,0x00,0x30,0x00};

static const uint8_t read_adc[]					= {0xff,0xff,0xff};     								//ADC conv NULL array for 3 bytes each RTD and TC values
static const uint8_t read_reg [] 				= {0x20,0x03,0x00,0x00,0x00,0x00};
static const uint8_t adc_sleep [] 			= {0x03};

static const uint8_t adc_idac_config[]	= {0x4A,0x01,0x03,0x2F};//250uA
//static const uint8_t adc_idac_config[]	= {0x4A,0x01,0x03,0x20};//250uA
//static const uint8_t ADC_WR_SETUP_EXC[]	= {0x4A,0x01,0x01,0x2F};//50uA
static const uint8_t m_length_exc 			= sizeof(adc_idac_config);




static const uint8_t m_length_setup_rtd = sizeof(adc_conf_rtd);

static const uint8_t m_length_setup_tc 	= sizeof(adc_conf_tc);        	/**< Transfer length. */
static uint8_t m_length_conv 						= sizeof(read_adc);        			/**< Transfer length. */
static const uint8_t length_read_reg 		= sizeof(read_reg);        			/**< Transfer length. */
static const uint8_t length_rx_buf 			= sizeof(m_rx_buf);
static const uint8_t m_length_sleep 		= sizeof(adc_sleep);


uint8_t Rx_bufc[3];
uint8_t Rx_buf[10];
uint8_t tensc;
uint8_t onesc;
uint8_t hundredsc;
uint8_t const * spi_tx_buff_ptr;
uint8_t connected;
uint8_t adv;

//ADC
#define ADC_BUFFER_SIZE 10
static nrf_adc_value_t       adc_buffer[ADC_BUFFER_SIZE]; // ADC buffer 16 bit values
/**
 * @brief Function for main application entry.
 */
void adc_read_sample(void)
{
	/*
	 * Use nrf_drv_adc_buffer_convert to perform multiple conversions on multiple channels. 
	 * This function sets up ADC but does not trigger a conversion. Conversions can be triggered 
	 * either by calling nrf_drv_adc_sample or with PPI. The task address for PPI can be retrieved 
	 * through the driver by calling nrf_drv_adc_start_task_get.
	*/
	APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));//int16_t adc_buffer, 16 bit var array. ADC is 10 bit
	uint32_t i;
	for (i = 0; i < ADC_BUFFER_SIZE; i++) // Fill up ADC buffer with 10 bit values
	{
		// manually trigger ADC conversion
		nrf_drv_adc_sample();
//            // enter into sleep mode
//            __SEV();
//            __WFE();
//            __WFE();

//            nrf_delay_ms(100);
//            LEDS_INVERT(BSP_LED_0_MASK);
   }

}


/*
 * Convert uint32_t hex value to an uint8_t array.
 */
void hexdec_long( uint32_t count )
{	
    uint8_t ones;
    uint8_t tens;
    uint8_t hundreds;
    uint8_t thousands;
    uint8_t thousand10s;
    uint8_t thousand100s;
    uint8_t mill;
    uint8_t mill10s;
    uint8_t mill100s;
    uint8_t bills;
    
		bills						= 0;
		mill100s				= 0;
		mill10s					= 0;			
		mill						= 0;
		thousand100s 		= 0;
		thousand10s 		= 0;
		thousands 			= 0;
		hundreds 				= 0;
		tens  					= 0;						
		ones 						= 0;

		while ( count >= 1000000000 )
		{
			count -= 1000000000;				// subtract 1000000000, one billion		
			bills++;										// increment billions
		}
		while ( count >= 100000000 )
		{
			count -= 100000000;					// subtract 100000000, 100 million		
			mill100s++;									// increment 100th millions
		}
		while ( count >= 10000000 )
		{
			count -= 10000000;					// subtract 10000000		
			mill10s++;									// increment 10th millions
		}
		while ( count >= 1000000 )
		{
			count -= 1000000;						// subtract 1000000	
			mill++;											// increment 1 millions
		}	
		while ( count >= 100000 )
		{
			count -= 100000;						// subtract 100000		
			thousand100s++;							// increment 100th thousands
		}	
		while ( count >= 10000 )
		{
			count -= 10000;             // subtract 10000
			thousand10s++;							// increment 10th thousands
		}
		while ( count >= 1000 )
		{
			count -= 1000;							// subtract 1000	
			thousands++;								// increment thousands
		}
		while ( count >= 100 )
		{
			count -= 100;               // subtract 100	
			hundreds++;                 // increment hundreds
		}
		while ( count >= 10 )
		{
			count -= 10;								// subtract 10		
			tens++;											// increment tens
		}
			ones = count;								// remaining count equals ones
				
			Rx_buf[0]= bills + 0x30;    //Conver HEX to character
			Rx_buf[1]= mill100s + 0x30;
      Rx_buf[2]= mill10s + 0x30;
      Rx_buf[3]= mill + 0x30;
      Rx_buf[4]= thousand100s + 0x30;
      Rx_buf[5]= thousand10s + 0x30;
      Rx_buf[6]= thousands + 0x30;
      Rx_buf[7]= hundreds + 0x30;
      Rx_buf[8]= tens   + 0x30;
      Rx_buf[9]= ones + 0x30;
		return;
}
/*
 * Convert uint8_t hex value to an uint8_t array.
 */
void hexdec_char( uint8_t countc )
{	
	hundredsc = 0;
	tensc  		= 0;						
	onesc 		= 0;
	while ( countc >= 100 )
	{
		countc -= 100;	// subtract 100
		hundredsc++;		// increment hundreds
	}

	while ( countc >= 10 )
	{
		countc -= 10;		// subtract 10
		tensc++;				// increment tens
	}

