attacker145/NRF51822v01/examples/ble_peripheral/ble_app_uart/main_Rev01.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        //APP_UART_FLOW_CONTROL_ENABLED,
			  APP_UART_FLOW_CONTROL_DISABLED,
        false,
        //UART_BAUDRATE_BAUDRATE_Baud115200
				UART_BAUDRATE_BAUDRATE_Baud9600
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


void DisplayConfigTC (void){
			uint8_t cntr = 0;		
			uint8_t cntr_int = 0;
			uint8_t cntr_ext = 0;
			//uint8_t str1[] = "Number Bytes sent";	
			uint8_t str2[] = "TC applied config:";
			uint8_t str3[] = "TC config verified";
			uint8_t str4[] = "*******************";																		
			// Configuration data TC
			cntr = 0;
			for (cntr_ext = 0; cntr_ext < 6; cntr_ext++){
				hexdec_char( (uint8_t) adc_conf_tc[cntr_ext] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}
			//Read Internal Registers		*********************************************************************		
			nrf_delay_ms(1);					
			//Read Internal Registers ******** Read Internal Registers ********Read Internal Registers ********
			spi_tx_buff_ptr = read_reg;		// Initialize pointer to read register buffer	
			// Reset rx buffer and transfer done flag
			memset(m_rx_buf, 0, length_rx_buf);
			//memset(m_rx_buf, 0, 13);
			spi_xfer_done = false;	
			// Read internal registers into m_rx_buf
			APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, length_read_reg, m_rx_buf, length_read_reg));
			//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
			while (!spi_xfer_done)
			{
				__WFE();
			}				
			//nrf_drv_spi_uninit(&spi);							
			//Read Internal Registers: Convert binary value to decimal ********
			cntr = 0;
			for (cntr_ext = 0; cntr_ext < 2; cntr_ext++){
				hexdec_char( (uint8_t) read_reg[cntr_ext] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf1[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}					
			for (cntr_ext = 0; cntr_ext < 4; cntr_ext++){
				hexdec_char( (uint8_t) m_rx_buf[(cntr_ext + 2)] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf1[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}									
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str4, sizeof(str4));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str2, sizeof(str2));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, temp_buf, 18);
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str3, sizeof(str3));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, temp_buf1, 18);	
			nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, str1, sizeof(str1));
			//nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, temp_buf2, 3);
			//nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, str4, sizeof(str4));	
			//nrf_delay_ms(200);					
}

void DisplayConfigRTD (void){
			uint8_t cntr = 0;		
			uint8_t cntr_int = 0;
			uint8_t cntr_ext = 0;
			//uint8_t str1[] = "Number Bytes sent";	
			uint8_t str2[] = "RTD applied config:";
			uint8_t str3[] = "RTD config verified";
			uint8_t str4[] = "*******************";						
			//if ((cntr%10) == 0 || cntr == 0){												
			// Configuration data TC
			cntr = 0;
			for (cntr_ext = 0; cntr_ext < 6; cntr_ext++){
				hexdec_char( (uint8_t) adc_conf_rtd[cntr_ext] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}
			//Read Internal Registers		*********************************************************************		
			nrf_delay_ms(1);					
			//Read Internal Registers ******** Read Internal Registers ********Read Internal Registers ********
			spi_tx_buff_ptr = read_reg;		// Initialize pointer to read register buffer	
			// Reset rx buffer and transfer done flag
			memset(m_rx_buf, 0, length_rx_buf);
			//memset(m_rx_buf, 0, 13);
			spi_xfer_done = false;	
			// Read internal registers into m_rx_buf
			APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, length_read_reg, m_rx_buf, length_read_reg));
			//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
			while (!spi_xfer_done)
			{
				__WFE();
			}				
			//nrf_drv_spi_uninit(&spi);							
			//Read Internal Registers: Convert binary value to decimal ********
			cntr = 0;
			for (cntr_ext = 0; cntr_ext < 2; cntr_ext++){
				hexdec_char( (uint8_t) read_reg[cntr_ext] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf1[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}					
			for (cntr_ext = 0; cntr_ext < 4; cntr_ext++){
				hexdec_char( (uint8_t) m_rx_buf[(cntr_ext + 2)] );
				for (cntr_int = 0; cntr_int < 3; cntr_int++){
						temp_buf1[cntr] = Rx_bufc[cntr_int];
						cntr++;
				}						
			}									
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str4, sizeof(str4));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str2, sizeof(str2));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, temp_buf, 18);
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, str3, sizeof(str3));
			nrf_delay_ms(200);
			ble_nus_string_send(&m_nus, temp_buf1, 18);	
			nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, str1, sizeof(str1));
			//nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, temp_buf2, 3);
			//nrf_delay_ms(200);
			//ble_nus_string_send(&m_nus, str4, sizeof(str4));	
			//nrf_delay_ms(200);					
				//}
}
/**@brief Application main function.
 */
//unsigned char *uart;

int main(void)
{
		uint32_t err_code;
		uint8_t cntr = 0;
		uint32_t difference = 0;
		//uint8_t cntr_int = 0;
		uint8_t cntr_ext = 0;
	  connected = 1;
		//uint8_t str1[] = "Number Bytes sent";	
		//uint8_t str2[] = "TC Config Data:";
		//uint8_t str3[] = "TC Regist Data:";
		uint8_t str4[] = "*******************";
		uint8_t str5[] = "TC Data:";
		uint8_t str6[] = "RTD Data:";
		uint8_t str7[] = "Result:";
		uint8_t diff[]				= {0x00,0x00,0x00};		// Difference array
		uint8_t read_tc[] 	 	= {0x00,0x00,0x00};
		uint8_t read_rtd[]  	= {0x00,0x00,0x00};
		uint16_t NmbrOfChar = 10;
		uint8_t *Rx_bufPtr = &Rx_buf[0];
//  uint8_t str5[] = "!DRDY, RDATAC sent";		
    bool 		erase_bonds;	
		
		nrf_gpio_cfg_output(21);				// START
		nrf_gpio_pin_set(21);						// START set high
		nrf_gpio_cfg_output(22);				// ADC RESET
		nrf_gpio_pin_set(22);						// ADC RESET set hight
		nrf_gpio_cfg_input(23, NRF_GPIO_PIN_NOPULL );
		//RESET pin low, START pin low, CS high
		nrf_gpio_pin_clear(22);					// RESET pin low
		nrf_gpio_pin_clear(21);					// START pin low
		nrf_delay_ms(40);
		//RESET pin high, START pin high		
		nrf_gpio_pin_set(21);			  		// START pin high
		nrf_delay_ms(2);
		nrf_gpio_pin_set(22);						// RESET pin high
		
		
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    
    buttons_leds_init(&erase_bonds);
		ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		
		//SPI-------------------------------------------------------------------------------
	  /*
	   *nrf_drv_config.h
	   *#define SPI0_CONFIG_SCK_PIN         16
	   *#define SPI0_CONFIG_MOSI_PIN        17
     *#define SPI0_CONFIG_MISO_PIN        18
		 *SPI is in master mode
		*/
		nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG(SPI_INSTANCE);	// Configure SPI nrf_drv_spi.h line 151
    spi_config.ss_pin = SPI_CS_PIN;				//CS is pin 19
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler)); //spi_event_handler_init
		//APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler_init));
		
		//Excitation current configure
		spi_tx_buff_ptr = adc_idac_config;		// Initialize pointer to the exitation config	
		// Reset rx buffer and transfer done flag
    memset(m_rx_buf, 0, m_length_exc);
		//memset(m_rx_buf, 0, 13);
    spi_xfer_done = false;	
		/*
		*Functions
		*ret_code_t 	nrf_drv_spi_init (nrf_drv_spi_t const *const p_instance, nrf_drv_spi_config_t const *p_config, nrf_drv_spi_handler_t handler)
		*Function for initializing the SPI master driver instance.
		*
		*void 	nrf_drv_spi_uninit (nrf_drv_spi_t const *const p_instance)
		*Function for uninitializing the SPI master driver instance.
		*
		*ret_code_t 	nrf_drv_spi_transfer (nrf_drv_spi_t const *const p_instance, uint8_t const *p_tx_buffer, uint8_t tx_buffer_length, uint8_t *p_rx_buffer, uint8_t rx_buffer_length)
    *Function for starting the SPI data transfer
		*/
		// Read internal registers into m_rx_buf
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_exc, m_rx_buf, m_length_exc));
		//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
		while (!spi_xfer_done)
    {
			__WFE();
    }
		nrf_delay_ms(10);
							
    printf("\r\nUART Start!\r\n");				 
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    										
		cntr = 0;
		// The main loop.
    for (;;)
    {								
				if(connected){
					nrf_gpio_pin_set(21);						// START set high			
					nrf_delay_ms(1);					
					if ((cntr % 2) == 0){	//Initialize TC ADC
						nrf_delay_ms(10);	
						spi_tx_buff_ptr = adc_conf_tc;	//Initialize pointer to ADC config: static uint8_t adc_setup_TC[]			= {0x40,0x03,0x01,0x02,0x40,0x71};			
						// Reset rx buffer and transfer done flag
						memset(m_rx_buf, 0, length_rx_buf);
						//memset(m_rx_buf, 0, 13);
						spi_xfer_done = false;
						//Configure TC ADC		
						APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
						//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, adc_setup_TC, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
						while (!spi_xfer_done)
						{
							__WFE();					//Configuring TC ADC
						}								
						//nrf_delay_ms(200);	
						if ((cntr%10) == 0 || cntr == 0){
								DisplayConfigTC();							// Print configuration
						}							
						//Read TC data	Read TC data	Read TC data	Read TC data		
						spi_tx_buff_ptr = read_adc;
						// Reset rx buffer and transfer done flag
						memset(m_rx_buf, 0, length_rx_buf);
						//memset(m_rx_buf, 0, 13);
						spi_xfer_done = false;
					
						while(nrf_gpio_pin_read (23)){}//!DRDY read_data_cont
						//power_manage();											
						APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_conv, m_rx_buf, m_length_conv)); // Read TC data
						while (!spi_xfer_done)
						{
							__WFE();
						}						
					
						read_tc[0] = m_rx_buf[0]; //MSB
						read_tc[1] = m_rx_buf[1];
						read_tc[2] = m_rx_buf[2];				
																
						NmbrOfChar = 10;
						Rx_bufPtr = &Rx_buf[0];
						//Remove front zeros
						cntr_ext = 0;
						while (Rx_buf[cntr_ext] == '0'){ //TC
							NmbrOfChar = NmbrOfChar - 1;
							Rx_bufPtr = &Rx_buf[cntr_ext];
							cntr_ext++;
						}
						ble_nus_string_send(&m_nus, str4, sizeof(str4));//*******************************
						ble_nus_string_send(&m_nus, str5, sizeof(str5));//"TC Data:"			
						//ble_nus_string_send(&m_nus, Rx_bufPtr, NmbrOfChar);	// Rx_buf is filled up in the handler. Send TC data
											
						ble_nus_string_send(&m_nus, Rx_buf, 10);	// Rx_buf is filled up in the handler. Send TC data
				}			
				else{	//Initialize RTD ADC****************************************************					
					nrf_delay_ms(10);	
					spi_tx_buff_ptr = adc_conf_rtd;	//Initialize pointer to ADC config: static uint8_t adc_setup_TC[]			= {0x40,0x03,0x01,0x02,0x40,0x71};			
					// Reset rx buffer and transfer done flag
					memset(m_rx_buf, 0, length_rx_buf);
					//memset(m_rx_buf, 0, 13);
					spi_xfer_done = false;
					//Configure TC ADC		
					APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_setup_tc, m_rx_buf, m_length_setup_rtd));
					//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, adc_setup_TC, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
					while (!spi_xfer_done)
					{
						__WFE();					//Configuring RTD ADC
					}			
					//nrf_delay_ms(200);	

					if ((cntr%11) == 0 || cntr == 0){
						DisplayConfigRTD();							// Print configuration RTD
					}
					
					//Read RTD data		
					spi_tx_buff_ptr = read_adc;
					// Reset rx buffer and transfer done flag
					memset(m_rx_buf, 0, length_rx_buf);
					//memset(m_rx_buf, 0, 13);
					spi_xfer_done = false;
				
					while(nrf_gpio_pin_read (23)){} //!DRDY read_data_cont
					//power_manage();					
					APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_conv, m_rx_buf, m_length_conv)); // Read TC data
					while (!spi_xfer_done)
					{
						__WFE();
					}											
																					
					read_rtd[0] = m_rx_buf[0];
					read_rtd[1] = m_rx_buf[1];
					read_rtd[2] = m_rx_buf[2];
					
					NmbrOfChar = 10;
					Rx_bufPtr = &Rx_buf[0];
					//Remove front zeros
					cntr_ext = 0;
					while (Rx_buf[cntr_ext] == '0'){ //RTD
						NmbrOfChar = NmbrOfChar - 1;
						Rx_bufPtr = &Rx_buf[cntr_ext];
						cntr_ext++;
					}	
					ble_nus_string_send(&m_nus, str6, sizeof(str6));
					//ble_nus_string_send(&m_nus, Rx_bufPtr, NmbrOfChar);	// Rx_buf is filled up in the handler. Send TC data
					ble_nus_string_send(&m_nus, Rx_buf, 10);	// Rx_buf is filled up in the handler. Send TC data		

