attacker145/NRF51822v01/examples/ble_peripheral/ble_app_uart/main_Rev01.c
					diff[0] = read_tc[0] + read_rtd[0]; // MSB
					diff[1] = read_tc[1] + read_rtd[1];
					diff[2] = read_tc[2] + read_rtd[2];	// LSB
													
					//ADC result is 3 byte long. 
					difference = (uint32_t) diff[0];						// Save byte 0 of the ADC result in uint32_t Result
					difference = (difference << 8);
					difference = (difference + (uint32_t)diff[1]);	// Save byte 1 of the ADC result in uint32_t Result
					difference = (difference << 8);
					difference = (difference + (uint32_t)diff[2]);	// Save byte 2 of the ADC result in uint32_t Result
					hexdec_long( difference );											// Convert Result into character string. Fills up Rx_buf																									
					NmbrOfChar = 10;
					Rx_bufPtr = &Rx_buf[0];
					cntr_ext = 0;
					while (Rx_buf[cntr_ext] == '0'){
						NmbrOfChar = NmbrOfChar - 1;
						Rx_bufPtr = &Rx_buf[cntr_ext];
						cntr_ext++;
					}
					
					ble_nus_string_send(&m_nus, str7, sizeof(str7));
					ble_nus_string_send(&m_nus, Rx_bufPtr, NmbrOfChar);	// Rx_buf is filled up in the handler. Send TC data
					//ble_nus_string_send(&m_nus, Rx_buf, 10);	// Rx_buf is filled up in the handler. Send TC data		
					LEDS_INVERT(BSP_LED_1_MASK);
					nrf_delay_ms(500);
					
					}																				
					nrf_gpio_pin_clear(21);						// START set low
					nrf_delay_ms(1);
					// ADC is stopped
				//if (cntr % 3 == 0){	
						
				//}																																			
					if (cntr <255)
						cntr++;
					else
						cntr =0;
				}
				else{	// Idle								
					LEDS_OFF(BSP_LED_0_MASK);
					LEDS_OFF(BSP_LED_1_MASK);
					LEDS_OFF(BSP_LED_2_MASK);
					LEDS_OFF(BSP_LED_3_MASK);
					nrf_gpio_pin_clear(22);					// RESET pin low
					nrf_gpio_pin_clear(21);					// START pin low
									
					spi_tx_buff_ptr = adc_sleep;		// Initialize pointer to read register buffer	
					// Reset rx buffer and transfer done flag
					memset(m_rx_buf, 0, m_length_sleep);				
					spi_xfer_done = false;			
					APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_sleep, m_rx_buf, m_length_sleep));
					//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
					while (!spi_xfer_done)
					{
						__WFE();
					}	
					
					sleep_mode_enter();
					//power_manage();				
					//__SEV();
					//__WFE();
					//__WFE();								
				}
					
					
					
			}	
}


/** 
 * @}
 */

